{
	"name":"strand-tab",
	"description":"A single tab.",
	"attributes": [
		{
			"name": "tabLabel",
			"type": "String",
			"optional": false,
			"attribute": "tab-label",
			"default": "",
			"description": "The text displayed on the tab"
		},
		{
			"name": "icon",
			"type": "String",
			"optional": true,
			"default": "",
			"description": "The name of an strand-icon displayed next to the tab label"
		},
		{
			"name": "url",
			"type": "String",
			"optional": true,
			"description": "Relative path to an external html document to lazily load into the tab. The content of the external document must be surrounded by a <template> tag and may use Polymer's binding annotations. Use the loadExternal method if a callback is required when the tab loads."
		},
		{
			"name": "active",
			"type": "Boolean",
			"optional": true,
			"default": "false",
			"description": "Whether this tab is active. There should only be one active tab at a time. If no active tab is set, the first tab defaults to active."
		}
	],
	"methods": [	
		{
			"name": "loadExternal",
			"description": "Lazily load this tab's content from an external html document, and attach a callback for when the tab content is loaded. The content of the external document must be surrounded by a <template> tag and may use Polymer's binding annotations.",
			"arguments": [
				{
					"name":"url",
					"type":"String",
					"optional":false,
					"default":"",
					"description":"Relative path to an external html document to lazily load into the tab."
				},
				{
					"name":"callback",
					"type":"Function",
					"optional":true,
					"description":"Function to call when the tab is loaded. The template instance is passed as an argument to the callback, useful when accessing properties on the current binding scope is needed."
				}
			]
		}
	],
	"events": [
		{
			"type":"loaded",
			"detail": [
				{
					"name":"label",
					"type":"String",
					"description":"The text label of the tab that fired the event"
				},
				{
					"name":"target",
					"type":"Object",
					"description":"Reference to the tab that fired the event"
				}
			]
		}
	],
	"behaviors":[
		"refable"
	]
}